eisup_2019_docmng_integration/src/InformationRegisters/ВерсииОбъектов/ВерсииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииОбъектов</name>
  <resources>
    <name>ВерсияОбъекта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДвиженияДокумента</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>АвторВерсии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВерсии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сжато</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ГраницыЗапретаИзмененияДанных/ГраницыЗапретаИзмененияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГраницыЗапретаИзмененияДанных</name>
  <resources>
    <name>ГраницаЗапретаИзменений</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>абс_ГраницаЗапретаВВодаПервичныхДокументов</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>абс_ГраницаЗапретаОбработкиБухгалтером</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>абс_ГраницаЗапретаИзмененийНУ</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/CommonModules/ВерсионированиеОбъектовПривилегированный/Module.bsl
// Записывает версию объекта в регистр сведений
Процедура ЗаписатьВерсиюОбъекта(знач СсылкаНаОбъект,
                                знач ЧислоВерсийОбъекта = Неопределено,
                                знач ХранилищеДанных,
								знач ДвиженияДокумента) Экспорт
	
	// Получим версию последнего объекта этого типа хранящегося в регистре сведений
	Если ЧислоВерсийОбъекта = Неопределено Тогда 
		НомерВерсии = ПолучитьЧислоВерсийОбъекта(СсылкаНаОбъект);
	Иначе
		НомерВерсии = ЧислоВерсийОбъекта;
	КонецЕсли;
	
	// Увеличиваем номер версии на 1
	НомерВерсии = Число(НомерВерсии) + 1;
	
	ДатаИзменения = ТекущаяДата();
	
	ВерсииОбъектов = РегистрыСведений.ВерсииОбъектов;
	
	МенеджерЗаписиИИО = ВерсииОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписиИИО.Объект            = СсылкаНаОбъект;
	МенеджерЗаписиИИО.ДатаВерсии        = ДатаИзменения;
	МенеджерЗаписиИИО.ВерсияОбъекта     = ХранилищеДанных;
	МенеджерЗаписиИИО.ДвиженияДокумента = ДвиженияДокумента;
	МенеджерЗаписиИИО.НомерВерсии	    = НомерВерсии;
	МенеджерЗаписиИИО.АвторВерсии	    = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписиИИО.Сжато             = Ложь;
	Попытка
		МенеджерЗаписиИИО.Записать();
	Исключение
		ВызватьИсключение "Ошибка записи версии объекта: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьСжатиеВерсийОбъектовПоРегламентномуЗаданию() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ Объект,  НомерВерсии, ВерсияОбъекта 
	                | ИЗ РегистрСведений.ВерсииОбъектов 
	                | ГДЕ Сжато = Ложь";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДвоичныеДанные = Выборка.ВерсияОбъекта.Получить();
		ХранилищеДанныхFastInfoSet = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		ВерсииОбъектов = РегистрыСведений.ВерсииОбъектов;
		
		МенеджерЗаписиИИО = ВерсииОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписиИИО.Объект       = Выборка.Объект;
		МенеджерЗаписиИИО.НомерВерсии  = Выборка.НомерВерсии;
		
		МенеджерЗаписиИИО.Прочитать();
		МенеджерЗаписиИИО.ВерсияОбъекта = ХранилищеДанныхFastInfoSet;
		МенеджерЗаписиИИО.Сжато = Истина;
		МенеджерЗаписиИИО.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЧислоВерсийОбъекта(знач Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	| ВЫБРАТЬ ЕСТЬNULL(Максимум(НомерВерсии), 0) КАК НомерВерсии
	| ИЗ РегистрСведений.ВерсииОбъектов
	| ГДЕ Объект=&Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	НомерВерсии = Выборка.НомерВерсии;
	
	Возврат НомерВерсии;
	
КонецФункции

Функция НеЗаписываемВерсиюВРегистр(знач Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Граница.ГраницаЗапретаИзменений КАК ГраницаЗапретаИзменений,
	               |	Граница.Организация
	               |ИЗ
	               |	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК Граница
	               |ГДЕ Граница.Организация = &Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГраницаЗапретаИзменений УБЫВ";
	
	
	Если Ссылка.Метаданные().Реквизиты.Найти("Организация") = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ Граница.Организация = &Организация","");
	Иначе
		Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
	КонецЕсли;	
		
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ГраницаЗапретаИзменений = ?(Выборка.ГраницаЗапретаИзменений = Null или Выборка.ГраницаЗапретаИзменений = Неопределено
								,'00010101',Выборка.ГраницаЗапретаИзменений);
	
	Возврат Ссылка.Дата > КонецДня(ГраницаЗапретаИзменений); 
	
КонецФункции
